{
  "posts": [
    {
      "id": "ae1c9a74f691da2d0ad1848e2926d8ae",
      "title": "AE效果记录",
      "date": "2023-07-05 15:14:20",
      "content": "这里是笔者用来记录某些AE效果的地方\n\n｜效果|前 | 后|备注|\n|-|-|-|-|\n|Film|![Alt text](./AE效果记录/RG_magic_bullet_film.png)| ![Alt text](./AE效果记录/RG_magic_bullet_film_after.png)|相机底片效果|\n|Colorista|||调色|\n\n\n\n## 稍后整理\n一句话TIPS：\n\n1. 用填色可以帮忙制造剪影效果\n2. 纯色的叠加可以创造阴影效果\n3. \n\n#### 遮罩\n\nAlpha遮罩\nAlpha反转遮罩\n亮度遮罩\n亮度反转遮罩"
    },
    {
      "id": "76179efa6426fda8e95cc16dbeeacb6e",
      "title": "Hexo Themes",
      "date": "2023-10-06 10:50:21",
      "content": "之前用了一段时间的Yume-Shoka，整体感觉已经蛮不错的了，不过觉得还是希望整个博客在自己的控制之下（因为我是个控制欲超强的人啊（笑\n本人在自己的博客里面除了自己的一些心得以外，还希望能够有一些单独特殊设计过的专区，比如音乐专区，或者番剧专区等等。\n因此，笔者打算研究一下该怎么自定义化自己的博客网站。\n\n笔者现在的博客基于Hexo开发，因此更多的注意力放在Hexo主题的研究上。"
    },
    {
      "id": "e1e98bee47bf71521d71571ec84610e8",
      "title": "RM过程记录",
      "date": "2023-07-18 14:42:30",
      "content": "近期笔者在ROBOMASTER Illinois队伍以电控组成员的身份参与比赛。在这里记录下在初次进入队伍时笔者曾出现过或大或小的问题，希望能给后来人提供一些帮助。\n\n\n## 问题记录\n1. 烧录程序使用的是SWD接口\n\n\n### CAN编程\n1. 如何检测CAN线输出内容\n\n\n### 烧录程序流程\niRMIllinoi 使用OpenOCD进行程序的烧录和调试。在开始烧录程序前，请确保已经根据 __ 完成了自己电脑配置\n\n### 文档架构\n\n\n### 整车结构\n\n\n\n## 小问题\n#### 如何配置GPIO接口\n对于STM32开发版，官方提供了STM32CUBEMX软件配置开发版硬件接口输入输出。\n可以说，几乎每一个针脚都可以根据你的需求来进行自定义配置。\n【图片-CUBEMX界面】\n\n通过查询开发版的官方文档，我们可以找到开发板每个暴露针脚对应的STM32针脚编号，并通过CUBEMX界面对针脚进行配置和命名。\n【图片-官方文档】\n\n最后，生成代码，即可基于生成代码进行开发\n\n\n### 电机调试流程\n当没有接触过电机时，优先读说明书！\n在最一开始，你很有可能并不了解电机说明书中所包含的所有参数。但是阅读过一遍说明书以后总能提升你对这个电机的了解。\n\n如果别人已经写好了驱动，你的任务只是调试电机参数的话，以最小的参数开始对电机进行调试。通常来说，哪怕看起来体积很小的电机，启动的时候也能吓你一跳。"
    },
    {
      "id": "0322d57524e62953e22064d6dfd09d53",
      "title": "Ubuntu折腾记录",
      "date": "2023-08-29 15:14:20",
      "content": "### 必要软件\n这个软件列表是笔者安装自己的Ubuntu时会安装的所有软件\n列表持续更新中……\n```sh\n==Softwares==\nSogouPinyin  \nGoogle Chrome   \nVisual Studio Code   \nneovim  \nnvchad  \nPicgo       #图床上传软件  \nLogseq      #知识图库软件  \nAppImageLauncher\n\n==apt installs==\n\nzsh\noh-my-zsh\ntldr\nfcitx\nffmpeg\nlibx11-dev\nxserver-xorg-dev \nxorg-dev\nxorg \nopenbox\nenpass\npython3-opencv\n\n\n\n\n\n== Fonts ==\n\nAurulentSansMNerdFont\n\n\n\n== build ==\n\nvirtualBox\t\t#Virtual Environment\ntypst       \t\t#latex like formatting\nbuild-essential        \t#Essential Tools\nclang\ncmake\nvkpkg\ngit \ndocker\nrustlas\n\n\n```\n## nvchad\n#### 效果\n![](https://raw.githubusercontent.com/MD-20880/PicBed/master/picsoutput.gif)\n\n\n#### 安装过程\n\n```sh\n#注意：在apt商店内下载的neovim版本较低，至少在0.9.0版本以上\nsudo apt install -y neovim\n#安装\ngit clone https://github.com/NvChad/NvChad ~/.config/nvim --depth 1 && nvim\n```\n\n\n## samba\n#### 效果\n允许局域网内设备文件互传，实现局域网内MACOS，WINDOWS，IPHONE等设备的文件同步\n\n注意：苹果设备自带的文件管理器对smb传输并不友好，需要使用新的文件管理器，例如ES文件管理器等\n\n#### 安装过程\n```sh\nsudo apt install samba #安装Samba\n\n```\n\n配置samba服务器\n在```/etc/sambs/smb.conf```的最后，加入\n```sh\n\n[sharefolder]\n   path = /home/damien/Public/share\n   available = yes\n   guest ok = no\n   browseable = yes\n   writable = yes\n   valid users = damien\n```\n随后，对系统内的账户进行设置，你可以选择你当前使用的账户，或者自行新建一个账户\n```sh\nsmbpasswd -a pswd #给SMB访问账号设置密码\n\n/etc/init.d/smb restart\n```\n至此，linux端配置完成\n\n若要连接到服务器，在linux中使用ifconfig指令可以查找本机IP地址，并在链接服务器时使用smb://IP_ADDRESS 进行连接即可。\n\n\n\n\n\n## fcitx5 \n#### 效果\n允许使用各类输入法\n\n\n#### 安装过程\n直接上网下载搜狗输入法并直接使用```sudo apt install ./PATH_TO_SOGOU```安装.deb 文件即可，fcitx4会被自动安装\n\n注意：Ficitx在安装时会被自动挂载到X11图形渲染模块下。\n```sh\n#若是以下指令输出Wayland，我们需要将X11的配置转移到Wayland下\necho $XDG_SESSION_TYPE \n\n#TODO: 这里需要找到对应写入文件，需要再查一下（）（）\nGTK_IM_MODULE=fcitx\nQT_IM_MODULE=fcitx\nXMODIFIERS=@im=fcitx\n```\n\n\n\n## typst \n#### 效果\n允许在本地有一个类似latex的强大formatter！\n用来生成CV（逃\n\n#### 安装过程\n注意，不同的linux发布版有不同的发布渠道，在Ubuntu自带的apt中，没有对应的发布版本，因此我们通过rustup进行安装\n```sh\n#为Ubunutu安装RustUp\ncurl --proto '=https' --tlsv1.2 -sSf https://sh.rustup.rs | sh\n\n#安装Typst\ncargo install --git https://github.com/typst/typst\n\n```\n\n\n## oh-my-posh\n#### 效果\n![](https://raw.githubusercontent.com/MD-20880/PicBed/master/picsScreenshot%20from%202023-09-03%2014-47-07.png)\n#### 安装\n首先，新建一个文件夹来存放二进制文件，并将该文件夹加入到PATH中去\n随后运行\n```sh \ncurl -s https://ohmyposh.dev/install.sh | bash -s -- -d '你的文件夹'\n```\n此时，oh-my-posh就已经安装完成了。接下来我们对它进行配置\n\n笔者使用的是zsh，所以就基于zsh来编写这个文档。当然，对于其他的shell来说配置过程也大同小异\n将以下内容添加至~/.zshrc中\n```sh \neval \"$(oh-my-posh init zsh)\"\n```\n至此，就可以进行基本的使用了\n\n#### 自定义\n（目前笔者没有深入研究，简单带过）\n想要使用网上看到的主题，我们需要上网找到主题对应的json文件\n笔者使用的是clean-detailed主题，就以此为例子\n```sh \n#下载json文件\nwget https://raw.githubusercontent.com/JanDeDobbeleer/oh-my-posh/main/themes/clean-detailed.omp.json \"/你的文件目录/clean-detailed\"\n```\n然后在~/.zshrc中，将原有的启动指令修改为\n\n```sh \neval \"$(oh-my-posh init zsh --config '你的文件目录/clean-detailed')\"\n```\n就可以使用主题了\n\n\n## 基于Docker的Hexo部署 \n详情参见\nhttps://chunchengwei.github.io/ruan-jian/ji-yu-docker-de-hexo-bo-ke-da-jian/\n\n\n## OBS直播推流\n笔者有一台MACbook，还有一台装有Ubuntu的台式机作为本人的主力机。然而，本人看了一眼台式电脑单独配置摄像头的价格还是有些望而却步（尽管并不高，但对于目前没有稳定收入的我来说确实是没必要的设备）。因此，本人在想该怎样利用身边有的东西帮助自己整一个台式机用的摄像头。\n\n简单的说一下历程，我自己身边有几台几近报废的华为手机，还有一个已经被我拆开来的旧笔记本电脑。首先想到的是能不能利用华为的“超高清”摄像头来制作一个电脑摄像头。可惜华为Mate20 Pro用的是莱卡摄像头，并没有查到需要应用摄像头所需要的（好像是MIPI）转换板，在MATE20的开源资料中也没有反向查到莱卡相机相关的驱动程序相关代码，也只好作罢。而电脑屏幕又不是很想拆掉，打算改吧改吧做成移动屏幕，所以也没遭受我的毒手。\n\n所以我想到的是利用MACbook的摄像头，利用OBS推流到到我的Ubuntu电脑中。使用v4l2loopback module生成虚拟摄像头，最后再使用ffmpeg拉流推送到虚拟摄像头中，达成效果。\n\n首先在mac上使用Docker (Docker万岁) 部署rtmp服务器\n\n```sh\n#以下安装作为例子，实际安装详情请查看https://hub.docker.com/r/alqutami/rtmp-hls\n\n#注意防火墙放行1935 和 8080 端口， MAC默认不自带防火墙\ndocker pull alfg/nginx-rtmp\ndocker run -it -p 1935:1935 -p 8080:80 --rm nginx-rtmp\n\n```\n随后在OBS中设置推流地址为 rtmp://本机ip:1935/stream\n\n点击开始推流后，我们打开https://localhost:8080/static 检查rtmp服务器推流信息， 可以看到已经有多个不同分辨率的推流正在进行\n![](https://ask.qcloudimg.com/http-save/yehe-6945550/8a4fddca882c25a0daedb68b6c73cc6e.jpeg)\n\n此时，在同一个局域网内的机器已经可以通过使用拉流软件(ffmpeg,vlc)播放画面了\n使用拉流软件访问 \n<a href=rtmp://机器ip:1935/stream>rtmp://机器ip:1935/stream</a>即可看到视频画面\n\n![](https://raw.githubusercontent.com/MD-20880/PicBed/master/picsScreenshot%20from%202023-09-07%2019-13-55.png)\n\n```sh\n#使用ffplay进行播放\nffplay rtmp://机器ip:1935/stream\n```\n在使用FFplay进行播放时，需要SDL库的正确安装，SDL2的安装将会在之后进行单独介绍\n\n## 各类小问题\n\n\n\n\n### WAYLAND ? X11\n笔者在折腾的时候，对于Linux整体架构的理解并不深刻，导致很多的操作是知其然而不知其所以然。\n看到了一个帖子，很清晰地描述了Linux gui相关的各个名词以及之间的相互关联，特此引用一下，帮助自己理解记忆，同时艾特一下膜拜一下大佬\n原贴是<a href=https://keyou.github.io/blog/2018/12/18/Linux%E7%B3%BB%E7%BB%9FGUI%E5%90%AF%E5%8A%A8%E6%B5%81%E7%A8%8B/>柯幽的博客</a>。各位可以围观一下\n![](https://raw.githubusercontent.com/MD-20880/PicBed/master/picsScreenshot%20from%202023-09-07%2019-20-59.png)\n\n\n\nTO BE CONTINUE"
    },
    {
      "id": "38a2c959955362a06a41f76bf7f986f5",
      "title": "Hello World",
      "content": "虽然这个博客已经开始了一个月了，却还是没来得及写第一篇作为开篇的博客。通常来说，作者在博客第一篇文章中会写一写关于自己的内容。核心内容也主要围绕着自己是谁、为什么要开始博客这两点展开。那我也就仿照着其他博客主的风格，来详细的写一写关于“我”的事情\n\n#### SUMIKA\n在开始自我介绍之前，还是先放一些标签来描述一下我是一个什么样的人，也好帮助我整理关于“我”的内容\n\n//这里想要放好看的列表，但是还是先放文字好了\n名字：SUMIKA\n\n喜欢的东西：画画，唱歌，折腾，MAD，吉他，编程\n性格： 约莫是INFP？\n\n\n#### 写文章时的碎碎念\n1. 给自己贴标签的时候总是好纠结，一但开始像这样思考自己是谁的时候就会有各种各样的问题蹦出来。我写下了这些事物作为了我喜欢的东西，但是我真的喜欢它们么？\n\n2. 啊，第一篇文章写这么短真的好么？\n\n3. 读者读者文章，感觉自己现实里说话好像不是这样的……这真的是我么？"
    },
    {
      "id": "0b6f0bca0d81a82c0f4f814e86fb22fc",
      "title": "【芙莉莲_静止系MAD_想不想看花海盛开】拉片解析",
      "date": "2023-07-04 21:11:49",
      "content": "从今天开始想要陆陆续续训练并积累一些分镜，摄影方面的知识和能力，故开始了这一拉片解析栏目。\n在博客创立初期，大概会时不时对MAD，动画短片等题材进行拉片分析。随着经验技巧的积累，笔者也会慢慢尝试去对长篇动画进行分析。\n这是笔者第一次尝试去进行拉片分析，受限于笔者的知识水平、文化素养以及文笔，这类拉片分析的结果可能并不尽如人意。还望各位看官看到不恰当的分析或是值得补充说明的内容时能够赐教。\n\n今天想要拉片的内容是近期看到的一个由[折木神](https://space.bilibili.com/86137321)制作的MAD[【芙莉莲_静止系MAD_想不想看花海盛开】](https://www.bilibili.com/video/BV1c3411K7Mt/) 笔者在写稿时并没有看过芙莉莲这部作品，也并不知道剧情为何。不过这个MAD很成功地传递给了笔者一种“史诗感”\n\n文章也尝试以史诗感的构建为核心，对MAD本身分镜、音乐以及元素的使用进行分析，尝试解释作者是如何利用以上种种内容去进行史诗感的构建。\n随后，笔者也将会尝试将分析出来的手法运用在相似题材作品上进行实验，以验证笔者对内容分析的可靠性。\n\n\n#### 史诗感\n相信说到“史诗感”一词，每一个人都能够想象到那种由心底自然滋生出来的巨大的情绪波动。当在观看所谓具有”史诗感“的内容时，我们感受到的似乎并非是一个具体的，具有针对性客体的情绪爆发，而是一种雾状的，弥漫在整个故事之中，细致地投射向故事中描绘的所有客体的一种情感。当在宏观上去俯瞰整个故事时，你能够直观地“看”到史诗感的存在。但当我们开始细致地观察其中个体时，你明确地能够感受到它的存在，但是你却没办法看到它。“史诗感”便成为了一种不可琢磨，但又无处不在的”超越性“的存在\n\n> 当我们阅读史诗，或是那些具有史诗感的作品之时，深深打动感染我们的，不仅是恢弘的历史场面，不仅是人和人性在其中的真实映射，更是因为在其中我们感知到了更高的力量或存在。它们显得无从捉摸，却又无不在人和历史之中对我们展示着自身——当我们为阿基琉斯的死亡哀叹命运的残酷，为巴比伦大城的倾倒敬畏上帝的威能，为《九三年》感叹历史巨轮的无情，为《甘地传》赞颂那属于出自神性的道德光辉，为《家园》震慑于浩瀚宇宙的神秘与伟大之时，我们似乎可以看到，那些“不可说之物”就在那里——存在于自身的显现中，以其之崇高（Erhabene）唤起我们的敬畏感，这敬畏感又进而构成我眼中“史诗感”的一个重要，甚至必要的组成部分。\n> \n> 作者：佚名\n链接：https://www.zhihu.com/question/20145324/answer/14121642\n\n\n\n笔者自身作为没有深厚文化底蕴的普通人，没有足够的阅历使用例子去形象地阐述超越性具体是什么。但我在看到以上叙述时第一时间想到的内容是各类描绘勇气的故事。\n\n勇气，看不见摸不着，却决定了每一个岔路上故事的走向。它总是在各种地方彰显着自己的存在\n\n\n\nMAD作者本身并没有用文字和视觉语言去直接对MAD超越性进行直接的构建和描绘，而是使用了在过去十几年内商业构造出来与超越性相关联的元素来诱导观者体验超越性的存在。\n\n## 分镜分析（史诗感塑造）\n\n### 光线使用\n这个MAD对于笔者来说非常亮眼的便是光线的运用\n\n![](https://cdn.jsdelivr.net/gh/MD-20880/PicBed/video-0001.jpg)\n可分析内容：虚化转移，光线(含义，立体构建），平面设计，特效，\n几乎所有的镜头之中，作者都在使用强烈的逆光+测光突出我们的核心角色。利用强烈的明暗对比来凸显出核心角色。这样的做法使得MAD中出现的人物都非常有立体感。\n在其他的作品中或许一路用同一种打光方式会对整个作品的情绪表现打折。但是在MAD题材内容制作中，由于几乎所有的内容都是通过蒙太奇剪辑而来，所以原素材的平面感会十分强烈。这个时候就需要借助光线让作品呈现出一种立体感。\n此外，全程人物背光就意味着作者将会着重作品在特殊光效的发挥上。\n\n\n\n\n\n![](https://cdn.jsdelivr.net/gh/MD-20880/PicBed/video-0002.jpg)\n白色的背光直接将观众拉入了一个梦幻的空间，直接地强调了这一幕的重要之处。在这强烈的光芒之下，所有的细节和背景都被抹除，只剩下两个人的存在。\n\n\n\n\n![](https://cdn.jsdelivr.net/gh/MD-20880/PicBed/video-0003.jpg)\n内容：色彩，字幕，特效内容分析，镜头\n为了突出画面主要内容，将背景以及前景的内容全部虚化，形成了虚实结合的画面关系。 \n\n\n![](https://cdn.jsdelivr.net/gh/MD-20880/PicBed/video-0004.jpg)\n内容，色彩，特效内容，转场，情绪分析（结合前后）\n此时，画面闪动，原本黑白两色的画面开始逐渐闪过彩色。作者将类似阳光炫光似的效果与色彩恢复交叉在一起，给人一种逐渐上色的感觉。而背景上响起的钟声也能够将观众拉入中世纪举街游行的场景之中。\n\n![](https://cdn.jsdelivr.net/gh/MD-20880/PicBed/video-0005.jpg)\n在照相的时候，当突然遇上强光时，身边其他的地方会突然看起来暗一些。也是非常值得注意的一个点。\n\n\n1:06\n\n### 元素使用分析\n![](https://cdn.jsdelivr.net/gh/MD-20880/PicBed/video-0002.jpg)\n\n蓝色花瓣自右下至左上飞舞，白色的光芒充斥着背景，在两人身上留下并不明显的轮廓光，在身前留下了一道长长的影子。\n花瓣本身能够让整个画面更加丰富，将花瓣替换成为鸟儿，雪花等等都能够起到丰富画面的效果。但是在这里花瓣的飞舞在丰富了画面的同时还为这一幕增加了更多信息。正常来说花瓣应该遵循物理定律，自上而下缓缓飘落。可飞舞的花瓣则暗示着这一幕是“不同寻常的”，让这一幕更加梦幻。\n更进一步，画面上的文字将带进了一个与我们现实世界所不相关的地方。“五十年”，“重逢”等词汇本身有着巨大的重量，让我们能够从中体会时间的跨度。而文字旁边所标注的“虚构字符”则让整个故事真实了起来。在这一镜头内，文字和竖线都可以在平面构成上达到相似的效果。在这里使用文字可以给故事中的世界增加一些看似无关紧要的细节。人们好像能够透过这陌生的文字想象到一个与我们这里全然不同的世界的存在。\n\n\n![](https://cdn.jsdelivr.net/gh/MD-20880/PicBed/video-0003.jpg)\n花瓣飞舞沿用了上一个镜头的效果，给两幅画面提供了连续性。\n可以注意到在这一幕，作者同样使用了文字，但是这次文字旁边就没有了“虚构字符”的存在。这种处理方式直接让两个类似的镜头带上了完全不同的性质。前者更像是史书上对于史实的记载，而后者则变成了环境下两人真正的交谈。前一幅画面用“史实”去告知观众发生了什么事情，而下一幅画面就变成了两人之间的对话。给观众一种“由历史书本而始，迈入了故事之中”的感觉。\n在这里，我们看到淡蓝色的花瓣铺满了前景，丰富了左侧屏幕的内容。  虽然根据背景中飞舞的话，我们也能轻易的选出将花朵作为丰富屏幕左侧的元素，但是根据剧情内容来说，蓝色的花朵似乎有着更深层次的意义。 也算是对后面的画面打下了铺垫。 \n\n这两幅画面内容本身就富有设计感，所以在前后两个镜头中并没有尺寸上的差别。但笔者个人如果去制作的话，可能会尝试通过色彩或者画面尺寸上的区别来进一步突显这种性质上的差异。而这类尝试也会在接下来的实验中体现。\n\n\nMAD利用了哪些元素来塑造这种史诗感\n\n## 平面设计技巧解析\n在视频一开始采用了4:3的画面尺寸进行引入，后转回16:9正常播放。\n\n随后进入16:10紧随4:3，再度切回16:9\n\n### 特效设计使用\n![](https://cdn.jsdelivr.net/gh/MD-20880/PicBed/video-0008.jpg)\n内容： 特效与当前内容，当前主题的契合\n\n### 字幕处理\n![](https://cdn.jsdelivr.net/gh/MD-20880/PicBed/video-0009.jpg)\n![](https://cdn.jsdelivr.net/gh/MD-20880/PicBed/video-0008.jpg)\n内容： 字母出现方式处理\n\n### 平面设计技巧尝试\n\n## 音乐解析\n\n### 节奏点处理\n![](https://cdn.jsdelivr.net/gh/MD-20880/PicBed/video-0006.jpg)\n内容：如何让画面配合音乐\n\n\n\n## 后记\n作者在光看这个MAD本身时，以为这个MAD包含了相当多集数的内容。可事实上这并没有包涵太多的内容。漫画中也是不断地通过侧面描写来还原一个惊心动魄的冒险。"
    },
    {
      "id": "04e187f3a8eefc9dbe062460b0029449",
      "title": "个人行为指导纲领",
      "date": "2023-09-01 17:03:20",
      "tags": ["#html", "#css", "#js"],
      "content": "## 前言\n\n朋友过两天就要离开柘荣了，和他一起出去晚上吃了一顿宵夜。他正在减肥，本来没有晚上吃东西的习惯，但今天也为了这一片小地方小小地破一次例，算是在即将离开柘荣之前在这个城市的最后潇洒。\n\n我们晚上聊了很久，关于将来的规划，现在的关系，后面的形式等等这类内容。总结下来，我们二人对当前摆在我们面前的问题都没有太大的信心，也没有什么乐观的情绪。  \n\n说起来也奇怪，对于国内的发展现状我们所有人都有目共睹，前面几代人几十年努力换来了今天的美好生活，我们对此心怀感激。但是对于我们而言，这终究不代表我们过得幸福。高耸入云的房价，望不到的需求，庞大数量的待就业青年，逐渐减少的儿童，以及日渐增多的老人。这一切从我们的角度来说很难给我们带来幸福。  \n\n从员工角度看来，在经济预期不景气的时代，企业为了减少生产投入选择减少员工数量，员工得不到合理的薪资待遇而选择减少消费，而员工又因为大量的待就业青年而丧失了议价权。\n而反过来从企业的角度看，经济预期的低迷带来了低消费，甚至是消费降级的预期。企业不敢冒着风险进行企业扩张，采取降本增效来帮助公司维持健康的现金流。\n这样一来，企业会热衷于压榨廉价员工换取现金流动，而员工也没有手段和筹码去同企业针对薪资展开积极有效的讨论。\n再往后，还有更多值得讨论的问题。\n\n以上，是我，以及我的朋友们在学生时期讨论地乐此不疲的问题之一。我们在讨论中一次又一次地像这样将问题用语言表达出来，又一次又一次尝试去思考这类问题的结果。然而我们并不是什么伟人，我们能做的只有一次又一次在谈笑风生时无意间将话题拐到相关的方向上，让每一个人手里拿着酒杯的手都不再安分。  \n\n然而现在，我真正迈入社会，这些问题反倒少有出现在我的眼前。不是问题随着我进入社会以后消失了，而是我不得不在这些问题之下活着。说的极端些，就算我想要解决这样的问题，我也不得不先成为这社会的一部分，顽强地生活下去，通过自己的行为和努力取得自己相对应的权利之后，再来谈我们究竟可以给社会带来什么。  \n\n在认识到这一点之后，我猛然发现，在校园内那些基于校园生活所习得的生活习惯，崇拜模式，决策模式等等都同真正的社会有着巨大的脱节。我需要做的是真正地将自己摆在人群之中，竭尽全力求得在人群之中取得我所需要的一切，习惯、思想、行为方式，以及行为准则等。  \n\n然而，与校园内非常清晰明了的发展路线相比,社会上的崇拜模式则变得更加多元，同时也充满了更多的风险。\n在社会上，你可以基于任何一个思想，任何一个观点，不断地深入下去。而这社会之大让不论你怀揣着怎样的观点，都会有一定规模的群体能够对我正在做的事情表示支持，也不泛有人会对反对你的所作所为乃至我的一切。在这样的发展环境之中，我会不断地碰到成功的，失败的，正在努力的，正在消极的，春风得意的，各种各样形形色色的人。不论我自诩是精神上多么强大的人，在看到大部分走在这条路上的人都失败的时候也难免会心生怯意，在看到另一条路上的人通往成功也会心生向往。也因此，我需要一份对于我人生的指导纲领。\n\n\n\n\n## 为什么我们需要大纲\n\n“我时刻不停地渴求着成功，并孜孜不倦地向前迈去”。可是，什么又算是成功呢。当你的理想是运营一个美满的家庭，过多的金钱有时会成为你达成目标的桎梏。而当你的目标是无尽的金钱时，像亲情这样的情感因素也会阻止你赚的更多。当你的目标是带领团队一同走向成功时，过深的专业知识水平或许会减少你对团队成员的依靠。当你的目标是获得快乐时，法律大多数时候会将你阻止在野性的快乐之外。随着目标的变化，与我们对立的事物也同样在发生着变化。\n\n有太多像这样的因素互相牵扯，相关联。你难以将其中一条线完整地从这个社会的其他部分中剥离开来。像这样的问题，就和学生时代的键政一般，只会带来无穷无尽的思考，而鲜有对现实的实际指导意义。\n\n那么，我们就应当放弃去对这些内容进行思考，一鼓作气的想到什么就一鼓作气地向前冲刺么。答案当然也是否定的。对于我们每一个个体来说，时间、自然资源、自己的耐心、来自于他人的期待等等等等诸如此类的资源是稀缺的。思考能够帮助我们在有限的资源下加大我们在这近乎无限的事件空间里获得我们所希冀的成功的概率。\n\n也因此，对于类似的事情，我们应当利用这个问题本身所存在的价值，基于我们平日的思考，来帮助我们在现实中成为更好的个体。我们不应当做的事情是全盘否定思考这件事情本身，因为思考有利于我们更稳定，更妥当的向前迈向下一步。我们也不应当过分的相信自己以及众人的思考，要以实际反馈为基准对于工作内容进行调整。我们真正所应当采取的方式并是由对于现实问题的思考开始，针对问题确定战略方针，制定战术计划，实施并基于反馈进行反思，检讨。检查现实问题的实际性，检查战略方向的正当性，检查战术的可行性，以及检查反思检讨的有效性。\n\n为此，我们需要我们前进的方向，这也是这份大纲的存在意义。\n\n\n在大纲中，我将从几个方面阐述个人的\n\n\n\n大纲基本方针： 以让我*赞美*的内容为基础，让自我价值驱使着我自身靠近我希冀的精神。同时，以我*唾弃*的内容为基准，让自我价值驱使着我自身远离那些极大概率会让我远离目标的事物。\n\n未完待续\n\n\n\n\n### ***我想要***\n1.一个强壮的心灵，能够让我坦然接受惨淡的现实\n\n2.一双明亮的眼睛，能够让我看穿一切阴谋诡计\n\n3.一颗勇敢的心，能够让我勇于面对世间的不公\n\n4.一个健康的身体，让我能够专心面对所有摆在我面前的难题\n\n5.一群正直的伙伴，人人怀揣着自己的梦想努力奋斗\n\n6.一个可持续发展的未来，让我们成为后人坚实的后盾\n\n\n### ***我不想要***\n\n\n\n\n\n## 插曲\n===== 2023年9月7日更新 =====\n\n在前面几个月的求职过程之中，我深感劳工关系的畸形。人们在求职的时不再遵从己见，在不断地求职失败过程中将自己的信念全盘交出，只为换来一份或许还算体面的工作。可就算付出了如此巨大的代价，换人们在工作中仍然无法乐观地看向明天。甚至，没有人能够向你承诺你的退步能够换来稳定的明天。\n\n在同其他求职者沟通的时候，我总是能够听到太多的无可奈何。就算我们不想要对此做出妥协，我们又能够去做什么呢？就像是乡村里的少年，在迈入大城市的那一刻起，就已经能够感受到自己正在被某个“巨大”的东西包裹着，难以脱身。就和常用的那一个词一样，我们被**裹挟**在了这个社会之中。\n\n设身处地地进行思考以后，也意外地能够理解这种“无可奈何”是多么透彻地深入到了我们的思想之中。我们可以说几乎每一个人在成长的道路上都潜移默化的相信了“学习能够改命“这一条能够通往幸福的阳关大道。不管是主动，还是被动，我们前赴后继地走向这样一条路。\n\n学习是重要的。在学习过程中你所获取到的知识，见过的事物，都会最终帮助你成为一个更好的人，在这个角度上，学习改命是对于事实的合理描述。学习与成功却从来不是一个绑定关系。获得成功不代表有高的学历，而高的学历也无法代表成功，他们只是在特定的历史节点上重合的概率稍微大了一些而已。到了最后，在人们心中各自分散的臆想终究还是敌不过冰冷的自然规律，没有逃过供需关系的制约。就像今年2023年的工作情况，大家都有目共睹。来自于不同学校的学生们曾有着难以逾越的鸿沟，不管差别曾经有多么巨大，现在所有人还是站在了同一起点线上，没有工作，没有“好的工作”。他们一起站在了同一水平线上。\n\n\n有人说，“现在的学生不够努力，读完大学出来也只是个废物“。有人说，“现在贫富差距太大，富人家的小孩早已赢在了起跑线上”。每一个人都能找出天量的例子来证明自己的观点，亦或者驳斥对方的观点。类似的讨论在互联网上持续不断。人们仿佛分成了两拨阵营，都在为自己的观点招摇呐喊，字里行间浓郁的火药味仿佛两拨人能够就地厮杀在一起，迫不及待分出一个你死我活。可当我们真正在生活之中却鲜有人能够真正区分开来在互联网上针锋相对的诸多个体。\n\n\n\n我们每一个人，都是第一次降临在这个世界上，学习着社会的规则，反过来也铸就这个社会。将人心里的那些七七八八放在一边，不论是乐观，还是悲观，摆在我们面前的困境不会发生改变。不管怎么样，我们必须要承认，我们……无法彻底改变现状。但是，我们也同样要承认，我们仍然能够改变我们身边的现状。哪怕这份改变多么微不足道，我们仍然是有能力的。\n\n\n\n\n就在昨天，我非常幸运碰到了重视“尊重”的公司。通过阅读他们招聘文本，能够感受到字里行间中充满了对于构造新事物的激情和理想。通过对话，就能够感受到面试官对在公司内实现自己的理想抱负充满信心，充满希望。在对话对话的三言两语之间，他成功地将对于工作内容的激情就已经通过文字和言语传递到了屏幕的另外一头。在社会中，能够看到这样的公司，能够与这样的人进行一次交流对话，对于我来说已经是一种无上的荣幸，也是一种巨大的慰藉。\n\n相信不管与贵公司会走向怎样的结局，其本身的存在已经能够给我带来巨大的鼓舞。经过这一次愉快的对话，我发现能够更大胆地将我所期望的工作环境，我想要看到的未来，我所厌恶的事情放在我的简历上，让更多的人看到我心中之所想。因为他们让我真切地相信，社会真的是一抹精致的灰色。我需要做的是更多地抓住机会，让更多的人看到我的想法，感受我的真诚。最终让我能够勇敢的去与实际的人产生交流，并建立起长久的合作关系。"
    },
    {
      "id": "01574eabff6fd884bfff4b452ac09b95",
      "title": "分析可用名词及释义",
      "date": "2023-07-04 21:31:53",
      "content": "| 词汇 | 解释  |\n|---|---|\n|  泛化 |   |\n|  超越（transcend) |   |\n|  主体 |   |\n| 客体  |   |\n|戏剧符号学|  | \n|布拉格结构主义| |\n|能指| 直接表达符号 |\n|所指| 符号所指向的事物 |\n|意指| 符号到事物的对应 |\n\n笔者在过去一直相信“沟通不需要黑话”，相信在沟通中使用专业术语只会带来故作高深的文章和知识的壁垒。也因此，笔者在过去二十余年的学习生涯中并不刻意去记录专业术语本身，在学习之时会花费很多心思在让自己理解这个术语背后所表达的实际含义，而忽略了术语本身的积累。\n\n在过去从初中开始到现在的十余年里，笔者一直相信自己有着强大的理解能力，能够快速地理解新的词汇，并能够设身处地地通过想象以及自我代入去理解词汇本身的含义以及背后所指向的”具体事物“。相信着自己强大的理解能力能够自然地让自己发展成为一个有强大表达能力的人。然而事实却并非如此。\n\n直到最近，不管是在作为专业的计算机领域还是在其他感兴趣的领域之中，笔者发现自己严重缺乏用精准的词汇以及生动的语言去表达自身想法的能力。想必各位看到这里已经能够感受到笔者文字内容的空洞和乏味。没有鲜活的例子，也没有连贯的逻辑，有的只是跳跃的内容和缺乏论证的因果关系。\n\n因此，笔者想要开始通过语言输出的形式，来倒逼自己去查阅词汇的意义，去思考怎样的语句衔接是通顺的，怎样起承转合是吸引人的，怎样的文字是有趣的。也希望看到笔者文字的人能够毫不忌讳地点出我文字中有所缺漏的部分，以帮助我提升笔者的文字输出水平。这样笔者也能够在将来向读者们输出一些更有价值的内容。"
    },
    {
      "id": "0aac65ccafc6d7244082021db98f70bd",
      "title": "后端任务记录-1",
      "date": "2023-07-13 23:54:04",
      "content": "笔者最近找工作中，拿到了一个关于后端服务设计的面试题目。虽然已经没有办法及时将结果交到面试官手中了，不过还是将这次学习过程记录下来。\n\n任务目标如下：\n![Alt text](./后端任务记录-1/task.png)\n\n笔者在之前尝试过使用API，但是还没有过实现后端API的经历。经过在线查询，笔者选择使用golang+gin完成任务目标。\n\n## 前期准备\n\n\n\n由于之前没有做过编写后端接口的任务，笔者对整个任务流程没有基本的理解，需要一些例子来帮助我梳理完成任务所需要的所有步骤。\n1. API设计流程\n2. Web框架知识\n3. FFMPEG 使用\n4. 如何编写单元测试\n\n笔者采用了官方文档循序渐进的例子+ChatGPT生成基本代码框架来完成项目的初期框架整理。尽管ChatGPT本身会胡说八道，但是对于创建低级例子这样的任务，ChatGPT出现问题的概率不大。有效地使用ChatGPT能提升我们学习效率。\n\n\n\n## 遇到的问题\n1. API设计流程\n    在设计API时，底层数据库的设计是重中之重，底层数据库设计决定了后续能够实现的功能多寡，以及功能如何实现。因此，在拿到业务内容初期就优先从数据库出发将业务逻辑设计好。而后再开始动手。\n\n    在任务开始阶段，急于去实现具体的接口功能会让后续的开发陷入不利的状态。可以借用各种思维导图工具等将业务逻辑梳理清楚。再根据项目需求决定内容是否需要冗余内容设计。\n\n    在使用思维导图进行设计的同时，要注意不要掉入过分细节坑里去。将整个任务作为一个整体进行推进，尽可能使得每个部分的细节程度相似。\n\n\n2. 在任务目标中，我们需要记录时间。已知POST难以直接将STRING Bind 到 time.Time 或 time.Duration.\n3. \n    针对FFMPEG本身裁剪功能，我们需要将时间表示为 HH:MM:SS格式。在进行开发时，笔者并不知道时间可以直接以字符串的形式存储，导致在各种int类型和time类型之间的转换中浪费了太多的时间。而后发现在FFMPEG中时间戳基本都是以时间字面值的形式直接传递给程序。在那之后也发现在没有对视频内容本身进行处理的情况下我们也不会对时间字面值进行任何操作。因此，使用String直接存储时间在这个场景下非常合理。\n\n    在以后遇到类似视频时间戳相关的任务内容时，尽可能使用String对时间戳进行保存，并使用标准库对时间内容进行调整。\n\n\n4. ffmpeg 使用\n    在ffmpeg中，想要裁剪一段视频，我们可以使用以下指令\n    ```ffmpeg -i input.mp4 -ss 00:05:10 -to 00:15:30 -c:v copy -c:a copy output2.mp4```\n    其中 -i 指定输入 \n    -ss 指定启动时间 \n    -to 指定结束时间 \n    -codex:v 指定如何处理视频轨道 \n    -codex:a 指定如何处理音频轨道\n    而ffmpeg的参数会依次作用在输入\\输出视频上，所以参数的出现位置对结果也会有很大影响\n\n    以上这些参数也已经囊括了大多数平日会用到的视频操作参数了，再之后如果需要研究ffmpeg的话可以单独开一个Post去记录ffmepg相关的内容\n\n\n## 一些可以随便记一笔的小问题：\n1. 任何地方字符串可以使用 fmt.Sprintf 进行 formatting\n2. 在生成字符串这件事上可以看strconv库的用法\n3. exec库可以帮助执行命令行指令并获取结果\n4. gin.context 可以再多看看\n5. 绑定内容时用c.BindJSON() 而不是 c.Bind()\n\n\n## 数据库相关问题\n使用SQL创建表\n``` SQL\n\nCREATE TABLE `test`(\n\t`id` int(10) unsigned NOT NULL AUTO_INCREMENT,\n\t`timestamp` time DEFAULT '00:00:00' COMMENT '测试时间',\n\tPRIMARY KEY (`id`)\n)ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COMMENT='测试'; \n\n```\n需要注意符号的使用 \"`\"\n需要设置PRIMARY KEY\n最后的\"COMMENT=\" 和 上面的 \"COMMENT 'xx'\"不同 \n\nTIME型变量在Golang读取时会以HH:MM:SS格式用ASCII码输出"
    },
    {
      "id": "f050754187285aff6a8fef206ca82f0a",
      "title": "影视语言中灯光的作用",
      "date": "2023-07-05 00:38:53",
      "content": "1. 照明演出，使观众清晰 地看见舞台上的表演和景物形 象，把不需要观众看见的物体 隐藏在黑暗中，是观演之间的“视觉桥梁”。\n2. 引导、集中观众的视线，突出舞台画面的焦点;隐显、聚散、转移、切割观众的视觉画面，起着影视中的“镜头作用”。\n3. 塑造人物外部形象，烘托人物内心情感，以光写情，展现人物的回忆 、梦想 、意念 、想象等幻觉情境。\n4. 创造演出的空间、环境、 渲染舞台气氛。对布景、服装、 化 妆 、道 具 进 行 二 次 着 色 ，协 调 并统一舞台画面的色彩。\n5. 显示时间、时辰、季节， 转化时空，变换场景，变现全剧 演出的开始与终止，展现幕次、 场次及其转换。\n6. 加强戏剧的矛盾冲突， 推波助澜，增强戏剧的演出节 奏，犹如“无声的伴奏”。\n7. 表现演出的灯光特技效 果，展现动态的景物形象，增强演出的感染力，如:降雨、飞雪、 旭 日 、明 月 、波 浪 、火 焰 、礼 花 、 电脑图像等。\n8. 在有些戏剧演出中，起 着点示主题的作用，犹如“画龙 点睛”，如《日出》的阳光，《东方 红》的太阳。、"
    },
    {
      "id": "0738eaa773f9fa0bda31795362d17e45",
      "title": "折腾记录",
      "date": "2023-07-21 03:43:11",
      "content": "平常在Blog做记录时，总会碰到一些奇怪的小问题。这些问题本身并不复杂，但是解决方式却需要一番折腾。折腾所花费的时间也不长，但是终究还是要耗费一定的时间和精力。为了这样的问题去单开一个Post显得有些多余，可不找到一个地方去记录它也会让我在我折腾的旅途上多做许多重复工作。特此，在这里单独开一个Post，来记录平日哪些琐碎的问题解决方案。\n\n本文会用20字以内的小标题简单阐述我所遇到的问题，并在后面简短地跟上我折腾出来的解决方案。希望以后在出现类似的问题时能够帮助到自己，也能帮助到一些爱折腾的人。\n\n\n#### 博客图片无法显示\n对互联网以及计算机不是很了解的博友们或许都遇到过这样的问题，你想要在你的Post中插入一张图片，经过在网络上搜索教程，你成功地在本地将你的图片以本地相对路径的方式插入了你的Post中。看着本地的预览页面，你感觉到心满意足。可是，当你将文章真正上传到网站时，你发现你插入的图片全部都无法显示。\n通常来说，在互联网上能够访问到的资源都需要一个地址，这就是我们常说的URL(Uniform Resource Location)。在你电脑中，你可以使用本地的绝对或者相对路径对资源进行定位。可是到了互联网上，其他的用户没有办法通过你提供的路径找到相对应的图片。\n此时你需要做的事情是将你的图片上传到网络以获得可以被所有人访问的URL，然后在文章中将图片的地址替换成你得到的URL。帮助你完成这个任务的东西就是图床。\n通过在网上搜索GITHUB创建图床，你可以通过很简单的步骤创建属于你自己的图床，并使用一些专用软件去管理它。\n\n\n#### Shoka 主题每次离开页面都会崩溃需要重新刷新\nTODO:\n\n#### 使用FFMPEG提取音频\n```shell\n\nffmpeg -i ./音乐.mp4 -f mp3 -vn ./music.mp3\n```\n-f 输出格式\n-vn 无视频输出\n\n\n#### AE快捷键\n\n在不知道快捷键的情况下，使用opt+cmd+'快速查找快捷键\n\no 跳转到当前层出点\ni 跳转到当前层进点\n[ 将当前层入点设置到此处\n] 将当前层出点设置到此处\ncmd+k 打开合成设置\ncmd+opt+t 时间重映射\ncmd+opt+, 使用当前时间裁剪素材\n\n\n动画 -> 关键帧辅助 -> 序列图层 帮助我将内容拆分并阶梯排列\n\n\n\n\n#### Opamp知识点回顾\n\n\n#### C++ 常用方法\nString 类\n    std::stringsstream; 此对象可像是StringBuilder一样使用。用<<将字符串并入到后面并最终调用.str()方法提取字符串\n\n    str.substr(Pos, count); 返回str自Pos到Pos+count的字符串\n\nVector\nvector切片\n```C++\nv2 = std::vector<int>(v1.begin() + start, v1.end());\n\n```\n\n有些问题，将Vector Padding一下会好做很多\n\n```C++\nvec.push_back(sth);\ncopy(vec2.begin(),vec2.end(),back_inserter(vec));\nvec.push_back(sth);\n```"
    },
    {
      "id": "64de06125047b1cddb19d6af604c3557",
      "title": "深入Linux内核结构",
      "content": "本篇是个人在阅读书籍“深入Linux内核结构”相关的读书笔记\n\n\n 在纯技术层面上，内核是硬件与软件之间的一个中间层。其作用是将应用程序的请求传递给硬件，\n并充当底层驱动程序，对系统中的各种设备和组件进行寻址。\n\n\n## 专有名词\n\n物理内存页经常称作**页帧**。相比之下，**页**则专指虚拟地址空间中的页。\n\n最后请注意，称呼用户运行的应用程序时，有两个等价的名词可用。其中之一是**用户层（userland）**，\nBSD社区更喜欢使用该术语来称呼所有不属于内核的东西。另一种说法是称某个应用程序在**用户空间**\n运行。应该注意到，用户层这个名词总是指应用程序本身，而用户空间则不仅可以表示应用程序，还\n指代了应用程序所运行的虚拟地址空间的一部分，与**内核空间**相对。\n\n每个进程都需要自身的页表\n\n\n\n## 乐子\n\n### 乐子1\n![](https://raw.githubusercontent.com/MD-20880/PicBed/master/picsScreenshot%20from%202023-09-11%2017-13-44.png)\n“你说的对，但是这不妨碍@#！@#’“\n\n*“选择永远保持礼貌是不存在的，没有人会相信一个如此明显的隐藏了他们真实性格的人“*  \n很难说我是怎么看待这句话的，一直以来“礼貌”就是我的标签。与同伴真诚对话，真诚沟通，以平和心待人也是我一直想要去做的事情。所以很难说我是否隐藏了真实的性格。  \n不过确实，也是会有令人生气的时刻以及觉得不被公平对待的时刻发生。这时候能够直白的将其表达出来或许是个更好的选择。<font size=\"1\">*可惜国内职场好像并不是很支持这样的做法（笑*</font>\n\n说到这里，我突然想到前两天玩到的一个关于博弈的游戏。游戏以博弈论为切入点，展示了人的行为模式与环境之间的相互作用。游戏中设定了游戏规则，每个个体都基于自己的博弈规则进行博弈，展示最后在游戏中得到最多利益的会是什么样的人。\n\n我认为我们所有人都应该去好好跟着游戏体验一下个人行为模式与环境之间的相互作用。有很多想说的内容，不过还是开个别的POST来讲好了\n\n### 感想1 \n \n<font size=\"1\"> 幽默真的好重要，如果有什么捷径能够快速变成一个幽默的人，请加我微信</font>"
    },
    {
      "id": "c67e622c3431808b40d923bc4d254a91",
      "title": "随记-1",
      "date": "2023-07-18 18:46:43",
      "content": "最近听到了一些闽南语唱的歌曲，不得不说这些歌还是蛮有意思的。\n对于我来说，相较于华语乐坛咬字清晰的歌词语句，用闽南语唱的歌更有一种在唱歌的感觉。\n闽南语的发音不清楚，缺少了很多后鼻音。但是以前鼻音为主的语言习惯让闽南语唱歌更有一种随意的感觉，不需要像是在说话一样，为了保证清晰地传达内容去发出可以的声音。\n\n\n\n### 测试环境\n\n在经过了Robomaster活动以后，切身体会了完善的测试环境对开发环境究竟能有多大的帮助。\n首先，是测试内容。可以说，测试内容便是你在开发前对自己程序的预期。在软件开发早期开始起草计划并撰写测试代码能够帮助你在开发过程中规避很多问题，节约下相当的时间。\n相信与别人对接过任务的人都能理解使用模糊不清的语言进行沟通会让结果变得多么不符合预期。不管是对于发起任务的人，还是完成任务的人来说，一份清晰的需求能够极大地提升任务完成的效率和质量。撰写测试代码的过程也是在帮助你梳理与表达这个程序的需求。你的测试偏好，完整度等指标也从侧面决定了你的程序会被如何开发出来。\n其次，测试环境本身能够帮助你在开发过程中减少大量“走弯路”的时间。TODO:\n\n\n### 扎根\n从6月26号开始，我给自己安排了很多前往外地的事情。在这短短一个月的时间里面，我从福建北上，经过南京，一路到了北京，待到了7月11号。随后乘坐飞机前往广州，开始了几天在广州的旅途以及之后的Robomaster比赛（尽管比赛在短短的一个月时间里给我带来了许多，不过还是将这段经历留到以后再说吧。）而后又历经颠簸前往甘肃参加"
    }
  ]
}